{"data":{"site":{"siteMetadata":{"title":"Thoughts on Things","author":"Michele Larson"}},"markdownRemark":{"id":"dea971f5-79c3-5afb-9bcd-6b794fc91f45","excerpt":"Memory Root kits - way to intercept the regular program flow so you can hide something on the machine. Can also apply to Windows, Android, Linux, etc. Windows…","html":"<h4>Memory</h4>\n<p>Root kits - way to intercept the regular program flow so you can hide something on the machine. Can also apply to Windows, Android, Linux, etc.</p>\n<p>Windows OS 64 bit, introduced the concept of digitally signing code = decline in rootkits but then they found their way around it.</p>\n<p>Most root kits try and go into the kernel mode because they have power to manipulate anything in the system. Kernel memory is flat with no security separation, so any kernel driver can access any part of memory.</p>\n<h4>Tools</h4>\n<h5>Cuckoo</h5>\n<p>After running Cuckoo (from previous week), you can inspect what it outputs in <code class=\"language-text\">C:\\Analyzer</code> and run the following commands to see what comes up:</p>\n<p><code class=\"language-text\">dir *</code></p>\n<p><code class=\"language-text\">dir*.*</code></p>\n<p><code class=\"language-text\">dir *.sys</code></p>\n<p>dir calls different APIs,</p>\n<p><code class=\"language-text\">dir bin</code> or <code class=\"language-text\">notepad wininit.sys</code></p>\n<p>RegShot - system diff tool- run before malware, run after, compare diff</p>\n<h6>Tuluka</h6>\n<p>Click on SST tab, then sort by suspicious column to view files that may have been modified. In this example NTQueryDirectoryFile shows up. These APIs passes information to the kernel. You can hook into this call and intercept it to do something else.</p>\n<p>You can see columns for “original” and “current” pointers which then you can use to inspect what is there at that memory address.</p>\n<h6>Live KD</h6>\n<p>(In Tools\\Windows Internals\\)</p>\n<p>Run <code class=\"language-text\">u 82e4daf</code> where 82e4daf is the pointer in memory you want to see. This shows you the code that that pointer.</p>\n<p><code class=\"language-text\">lm</code> - lists all modules loaded in kernel memory with their addresses</p>\n<p>Right click on a file in Tuluka and click “Restore Service” to see the file show up in the logs folder. Then you can investigate it.</p>\n<p><code class=\"language-text\">nds</code> - lists all system APIs and shows the address of where each call is (SSDT - System Service Destriptor Table). In your system, you can put your code in that location, put your function pointer there instead of original, but save the original address so you can call back to it.</p>\n<h5>WinDBG</h5>\n<p>You can go into View and Memory and overwrite the memory of a program.</p>\n<h5>Process Hacker</h5>\n<p>Similar to Process Explorer. Clicking on the Memory tab, you can see the memory starting at address memory 0 and walk through the virtual memory of the process, identifying some attributes about the process. It’s very suspicious if you see anything that doesn’t have a name and has read write execute permissions. Example: <code class=\"language-text\">Private (Commit)</code></p>\n<h5>SectEdit</h5>\n<p>You can go to any sector and read the contents from the disk. You can see the MBR here. </p>\n<h4>Thread Basics</h4>\n<p>Thread - smallest unit of execution within an operating system. </p>\n<p>When you launch a program, the binary sequence gets loaded into RAM before anything happens. Then, using a BUS, it transfers the code in the CPU. It fetches each instruction and executes it.</p>\n<p>A thread scheduler… schedules the threads ☺️ When creating a thread, you can use an API to set priorities for when your thread runs. If a thread is doing work and then another thread was doing work but now is waiting, it needs to save its context somewhere so it can come back to what it was doing. That gets saved in memory while the other thread is being executed. When it comes back to the second thread, the context is restored. Each thread has its own stack. Processes need at least one thread to execute, and each process includes an object table that has handles to other objects known to this process.</p>\n<h4>Hooks</h4>\n<p>Malicious code can hook into a process in user memory. For example, a process might do a call to a function at a certain memory address that will start with an instruction. The malware can change this first instruction to jump to another memory location and run the malicious code. </p>\n<h4>System Boot Process</h4>\n<p><a href=\"https://i0.wp.com/neosmart.net/wiki/wp-content/uploads/sites/5/2015/01/MBR-Boot-Sequence.png?resize=1024%2C385&#x26;ssl=1\">https://i0.wp.com/neosmart.net/wiki/wp-content/uploads/sites/5/2015/01/MBR-Boot-Sequence.png?resize=1024%2C385&#x26;ssl=1</a>\n<a href=\"https://neosmart.net/wiki/mbr-boot-process/\">https://neosmart.net/wiki/mbr-boot-process/</a>\nNow Microsoft has a Secure Boot which validates the process at each step.</p>\n<p>Bootkit vs rootkit - bootkit just modifies the MBR, but has no stealth component.</p>\n<h4>Trends in Stealth Malware</h4>\n<ul>\n<li>File forging - rootkits could modify a file and when you’re reading the file, they show you a different view</li>\n<li>Memory forging</li>\n<li>Self protection</li>\n<li>Attack AV</li>\n<li>Disassociating memory from file on disk - Root kits can utilize APIs that give away its associated file on disk</li>\n<li>File content foraging - modify some files on disk. If you try to read the file, they can insert anywhere on the chain</li>\n</ul>\n<hr>\n<h4>Lab - Agony Rootkit Analysis</h4>","frontmatter":{"title":"Thoughts on Windows Internals (Defense Against the Dark Arts)","date":"February 07, 2019","tags":["school","security"]}}},"pageContext":{"slug":"/security-windows/","previous":{"fields":{"slug":"/security-software/"},"frontmatter":{"title":"Thoughts on Software Vulnerabilities (Defense Against the Dark Arts)","tags":["school","security"]}},"next":{"fields":{"slug":"/security-final/"},"frontmatter":{"title":"Thoughts on Hacking Challenges (Final for Defense Against the Dark Arts)","tags":["school","security"]}}}}