{"data":{"site":{"siteMetadata":{"title":"Thoughts on Things","author":"Michele Larson"}},"markdownRemark":{"id":"6f0b19ec-1e81-5c4d-a4ec-df3f8661b6e8","excerpt":"Terms Spamtrap/honeypot - domain or address that only receives spam addresses (no legit emails) Botnet - machines that have been taken over and the user doesn’t…","html":"<h4>Terms</h4>\n<ul>\n<li>Spamtrap/honeypot - domain or address that only receives spam addresses (no legit emails)</li>\n<li>Botnet - machines that have been taken over and the user doesn’t support the end goal</li>\n<li>Showshoe spam - spreading load over many ISPs</li>\n<li>Phishing/Spear Phishing - email targeting specific individual or department that appears to be from a trusted source </li>\n<li>RBL - (realtime blackhole list) - tests mail server IP to see if it is known to be malicious</li>\n<li>Heuristics - you can build a list of rules, example - “subject like xxx” AND “from email like xxxx” AND “no attachment”</li>\n<li>Fingerprinting/Hashing - way to sign emails to ensure authenticity</li>\n</ul>\n<h4>Examples of malicious emails throughout history</h4>\n<ul>\n<li>419 phishing - “I’m a prince, send money” etc</li>\n<li>Canadian Pharmacy - Putting text in html span tags so it isn’t caught by heuristics, created a website that looks legitimate</li>\n<li>Pump ‘n dump - artificially creating demand for stock and then spammers dump the stock and the value goes down</li>\n</ul>\n<h4>Tools</h4>\n<ul>\n<li>DIG - DNS records <code class=\"language-text\">dig mydomain.com mx</code></li>\n<li>WHOIS - IP/Domain registration <code class=\"language-text\">whois google.com</code></li>\n<li>Databases - gather data, able to write sql queries to identify and group emails</li>\n<li>Regex - write rules for identifying spam</li>\n<li>Trustedsource.org - based on McAfee data</li>\n<li>spamhaus.org - reputation data</li>\n</ul>\n<h4>Techniques for understanding data</h4>\n<ul>\n<li>Parsing data</li>\n<li>Grouping - by timestamp, source_ip, subject, URL, etc</li>\n<li>Aggregation - count distinct values/time</li>\n<li>Identification of outliers - why may something highly similar be classified differently?</li>\n</ul>\n<hr>\n<p>This week was pretty light in terms of content prevented. Most of the examples were about how to write Regex and MySQL queries, which I have covered in other classes. </p>","frontmatter":{"title":"Thoughts on Email Security (Defense Against the Dark Arts)","date":"March 01, 2019","tags":["school","security"]}}},"pageContext":{"slug":"/security-email/","previous":{"fields":{"slug":"/security-web/"},"frontmatter":{"title":"Thoughts on Web Security (Defense Against the Dark Arts)","tags":["school","security"]}},"next":null}}