{"data":{"site":{"siteMetadata":{"title":"Thoughts on Things","author":"Michele Larson"}},"markdownRemark":{"id":"6f0b19ec-1e81-5c4d-a4ec-df3f8661b6e8","excerpt":"Terms Spamtrap/honeypot - domain or address that only receives spam addresses (no legit emails) Botnet - machines that have been taken over and the user doesn’t…","html":"<h4>Terms</h4>\n<ul>\n<li>Spamtrap/honeypot - domain or address that only receives spam addresses (no legit emails)</li>\n<li>Botnet - machines that have been taken over and the user doesn’t support the end goal</li>\n<li>Showshoe spam - spreading load over many ISPs</li>\n<li>Phishing/Spear Phishing - email targeting specific individual or department that appears to be from a trusted source </li>\n<li>RBL - (realtime blackhole list) - tests mail server IP to see if it is known to be malicious</li>\n<li>Heuristics - you can build a list of rules, example - “subject like xxx” AND “from email like xxxx” AND “no attachment”</li>\n<li>Fingerprinting/Hashing - way to sign emails to ensure authenticity</li>\n</ul>\n<h4>Examples of malicious emails throughout history</h4>\n<ul>\n<li>419 phishing - “I’m a prince, send money” etc</li>\n<li>Canadian Pharmacy - Putting text in html span tags so it isn’t caught by heuristics, created a website that looks legitimate</li>\n<li>Pump ‘n dump - artificially creating demand for stock and then spammers dump the stock and the value goes down</li>\n</ul>\n<h4>Tools</h4>\n<ul>\n<li>DIG - DNS records <code class=\"language-text\">dig mydomain.com mx</code></li>\n<li>WHOIS - IP/Domain registration <code class=\"language-text\">whois google.com</code></li>\n<li>Databases - gather data, able to write sql queries to identify and group emails</li>\n<li>Regex - write rules for identifying spam</li>\n<li>Trustedsource.org - based on McAfee data</li>\n<li>spamhaus.org - reputation data</li>\n</ul>\n<h4>Techniques for understanding data</h4>\n<ul>\n<li>Parsing data</li>\n<li>Grouping - by timestamp, source_ip, subject, URL, etc</li>\n<li>Aggregation - count distinct values/time</li>\n<li>Identification of outliers - why may something highly similar be classified differently?</li>\n</ul>\n<hr>\n<p>This week was pretty light in terms of the content presented. Most of the examples were about how to write Regex and MySQL queries, which I have covered in other classes. This was probably my least favorite week and topic in the course. Most of the techniques and examples talked about here we’ve already touched on before so I didn’t learn too much new. Plus, after doing the lab last week about classifying malicious URLs from data, which was really fun, this lab seemed too similar, but not as fun.</p>\n<p>I also really didn’t like that the majority of the time was spent talking about how to write regex for Viagra. I wish that they had used a different example. I know this is what you think of when you think of stereotypical spam content but I didn’t really enjoy to listen to the lecturer say that word 50 times, and there are so many other examples you can use.</p>\n<p>What I did learn is some tools for checking to see if emails are malicious, and if I ever do get an email that I’m not sure is spam or not, I can now read more information about it and look up the mail server to see what I can find from the message data. Other than that, I think I prefer other topics in security.</p>\n<p>Finally, I thought it was interesting and never really thought about how it’s worse to have a legitimate email go to your spam than vice versa. Lately I have had many emails go to spam on my Google email at work. Lots of legitimate ones including some sent from third party websites that my company uses, such as event planning sites. I think Gmail is stepping up their spam filtering but I do occasionally see emails go in there that shouldn’t.</p>","frontmatter":{"title":"Thoughts on Email Security (Defense Against the Dark Arts)","date":"March 01, 2019","tags":["school","security"]}}},"pageContext":{"slug":"/security-email/","previous":{"fields":{"slug":"/security-web/"},"frontmatter":{"title":"Thoughts on Web Security (Defense Against the Dark Arts)","tags":["school","security"]}},"next":{"fields":{"slug":"/security-mobile/"},"frontmatter":{"title":"Thoughts on Mobile Security (Final for Defense Against the Dark Arts)","tags":["school","security"]}}}}